In [33]:
'''
Created on 2020年1月30日

@author: JM
'''
import pandas as pd
import tushare as ts
from sqlalchemy import create_engine

# --------------------MySql简易教程--------------------

http://www.gembo.cn/app/3d/showContent2018.php?id=3089

## 一、MySQL的相关概念介绍

- 表头(header): 每一列的名称;
- 列(row): 具有相同数据类型的数据的集合;
- 行(col): 每一行用来描述某个人/物的具体信息;
- 值(value): 行的具体信息, 每个值必须与该列的数据类型相同;
- 键(key): 表中用来识别某个特定的人物的方法, 键的值在当前列中具有唯一性。

## 二、Windows下MySQL的配置

- 配置步骤
- MySQL服务的启动、停止与卸载


## 三、MySQL脚本的基本组成

- 标识符
- 关键字
- 语句
- 函数

## 四、MySQL中的数据类型

- 数字类型：整数: tinyint、smallint、mediumint、int、bigint；浮点数: float、double、real、decimal

- 日期和时间: date、time、datetime、timestamp、year

- 字符串类型：字符串: char、varchar；文本: tinytext、text、mediumtext、longtext；二进制(可用来存储图片、音乐等): tinyblob、blob、mediumblob、longblob

## 五、使用MySQL数据库

- 登录到MySQL
- 创建数据库
- 选择所要操作的数据库
- 创建数据库表

## 六、操作MySQL数据库

- 向表中插入数据
- 查询表中的数据／按特定条件查询
- 更新表中的数据
- 删除表中的数据

## 七、创建后表的修改

- 例：tushare之将所有股票日线数据导入mysql数据库----mysql建表的方法
- https://blog.csdn.net/weixin_43024409/article/details/85135320

- 添加列
- 修改列
- 删除列
- 重命名表
- 删除整张表
- 删除整个数据库

## 八、附录

- 修改 root 用户密码
- 可视化管理工具 MySQL Workbench

# 补充：python之cursor() — 数据库连接操作

https://blog.csdn.net/djy37010/article/details/70161218

# -------------------- TL时期文章数据库操作代码 --------------------

在mac里，搜索mysql_db

In [34]:
import pymysql

pymysql.install_as_MySQLdb()

In [35]:
engine_ts = create_engine('mysql://root:root@localhost:3306/data?charset=utf8')

def read_data():
    sql = """SELECT * FROM data.stock_basic LIMIT 20"""
    df = pd.read_sql_query(sql, engine_ts)
    return df


def write_data(df):#这里已经默认是data数据库下面的路径，因此stock_basic即为数据库路径下面的表名
    res = df.to_sql('stock_basic', engine_ts, index=False, if_exists='append', chunksize=5000)
    print(res)


def get_data():
    pro = ts.pro_api()
    df = pro.stock_basic()
    return df

In [36]:
if __name__ == '__main__':
    df = get_data()
    df = df.drop(['name','area','industry','market'], axis =1) # 发现无法插入是因为中文的问题
    write_data(df)

None

In [38]:
df

        ts_code  symbol list_date
0     000001.SZ  000001  19910403
1     000002.SZ  000002  19910129
2     000004.SZ  000004  19910114
3     000005.SZ  000005  19901210
4     000006.SZ  000006  19920427
...         ...     ...       ...
4015  688596.SH  688596  20200820
4016  688598.SH  688598  20200518
4017  688599.SH  688599  20200610
4018  688600.SH  688600  20200703
4019  688981.SH  688981  20200716

[4020 rows x 3 columns]

In [37]:
read_data()

      ts_code  symbol list_date
0   000001.SZ  000001  19910403
1   000002.SZ  000002  19910129
2   000004.SZ  000004  19910114
3   000005.SZ  000005  19901210
4   000006.SZ  000006  19920427
5   000007.SZ  000007  19920413
6   000008.SZ  000008  19920507
7   000009.SZ  000009  19910625
8   000010.SZ  000010  19951027
9   000011.SZ  000011  19920330
10  000012.SZ  000012  19920228
11  000014.SZ  000014  19920602
12  000016.SZ  000016  19920327
13  000017.SZ  000017  19920331
14  000019.SZ  000019  19921012
15  000020.SZ  000020  19920428
16  000021.SZ  000021  19940202
17  000023.SZ  000023  19930429
18  000025.SZ  000025  19930621
19  000026.SZ  000026  19930603

# 1、创建“股票列表”表结构，存为mysql_tables_structure.py

https://blog.csdn.net/icepsyche/article/details/94445279?utm_medium=distribute.pc_relevant.none-task-blog-BlogCommendFromMachineLearnPai2-1.channel_param&depth_1-utm_source=distribute.pc_relevant.none-task-blog-BlogCommendFromMachineLearnPai2-1.channel_param

In [17]:
# coding=utf-8

from sqlalchemy import Column, String, Float
from sqlalchemy.ext.declarative import declarative_base

Base = declarative_base()

class StockBasic(Base):
    """股票列表
    is_hs	    str	N	是否沪深港通标的，N否 H沪股通 S深股通
    list_status	str	N	上市状态： L上市 D退市 P暂停上市
    exchange	str	N	交易所 SSE上交所 SZSE深交所 HKEX港交所(未上线)
    """
    __tablename__ = 'stock_basic'

    ts_code = Column(String(10), primary_key=True)  # TS代码
    symbol = Column(String(10))         # 股票代码
    name = Column(String(10))           # 股票名称
    area = Column(String(4))            # 所在地域
    industry = Column(String(4))        # 所属行业
    fullname = Column(String(30))       # 股票全称
    enname = Column(String(100))        # 英文全称
    market = Column(String(3))          # 市场类型 （主板/中小板/创业板）
    exchange = Column(String(4))        # 交易所代码
    curr_type = Column(String(3))       # 交易货币
    list_status = Column(String(1))     # 上市状态： L上市 D退市 P暂停上市
    list_date = Column(String(8))       # 上市日期
    delist_date = Column(String(8))     # 退市日期
    is_hs = Column(String(1))           # 是否沪深港通标的，N否 H沪股通 S深股通

# 2、建立获取tushare数据函数，存为tushare_data.py

In [18]:
# coding=utf-8

import time
import pandas as pd


def get_stock_basic(pro, retry_count=3, pause=2):
    """股票列表 数据"""
    frame = []
    for status in ['L', 'D', 'P']:
        for _ in range(retry_count):
            try:
                df = pro.stock_basic(exchange='', list_status=status,
                                     fields='ts_code,symbol,name,area,industry,fullname,enname,market, \
                                    exchange,curr_type,list_status,list_date,delist_date,is_hs')
            except:
                time.sleep(pause)
            else:
                frame.append(df)
                break

    return frame

# 3、更新“股票列表”数据，存为mysql_functions.py

In [22]:
# coding=utf-8

import pandas as pd
# import tushare_data as td

def truncate_update(engine, data, table_name):
    """删除mysql表所有数据，to_sql追加新数据"""
    conn = engine.connect()
    conn.execute('truncate ' + table_name)
    data.to_sql(table_name, engine, if_exists='append', index=False)


def update_stock_basic(engine):
    """更新 股票信息 所有数据"""
    pro = ts.pro_api()
    df = pro.stock_basic()
    truncate_update(engine, df, 'stock_basic')

# 4、主程序

In [ ]:
# coding=utf-8

import pandas as pd
import tushare as ts
from sqlalchemy import create_engine

from mysql_tables_structure import Base
import mysql_functions as mf

# 创建数据库引擎
engine = create_engine('mysql://root:root@127.0.0.1/databasename?charset=utf8mb4') 
conn = engine.connect()

# 创建mysql所有表结构
Base.metadata.create_all(engine)

# 连接 tushare
ts.set_token(token****)
pro = ts.pro_api()

# 股票列表
mf.update_stock_basic(engine, pro, 3, 2)

# 读取数据

In [39]:
db_ip = '127.0.0.1'
db_user = 'root'#用户
# db_password = '1q2w3e4rasdf'#密码
db_password = 'root'
db_name = 'data'#数据库
db_port = "3306"

conn = pymysql.connect(db_ip,
                       db_user,
                       db_password,
                       db_name,
                       autocommit = 1)
cursor = conn.cursor()
engine = create_engine("mysql+pymysql://root:@localhost:3306/data.market_data")

In [33]:
engine

Engine(mysql+pymysql://root:***@localhost:3306/data.market_data)